Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Harness the magic of the stars themselves to slow and stun your enemies, and help Polaris not only take revenge on a traitor but also find her place in the world!
pt_pt: Usa a magia das próprias estrelas para desacelerares e atordoares os teus inimigos, e ajudares a Polaris não só a vingar-se de um traidor mas também a encontrar o seu lugar no mundo!

source: Become the leader and restore the Dominion to its former glory!
pt_pt: Torna-te o líder e restaura o Domínio à sua antiga glória!

source: The Archdemon won.
pt_pt: O Grão-Demónio venceu.

source: The Guardians have fallen, and many of them have turned into warriors of darkness.
pt_pt: Os Guardiões caíram e muitos tornaram-se guerreiros da escuridão.

source: But hope still lives — Aurora broke free of his power.
pt_pt: Mas a esperança não morreu. Aurora libertou-se do seu poder.

source: Now it's your turn to bring back the others!
pt_pt: Agora é altura de trazer de volta os outros!

source: Alliance is not just an RPG.
pt_pt: Alliance não é só um RPG.

source: It's a test of strategy, tactics, and resolve.
pt_pt: É um teste de estratégia, táticas e garra.

source: Gather a team of Heroes, upgrade their skills, predict enemy moves, and lead your army to victory!
pt_pt: Junta uma equipa de Heróis, melhora as suas habilidades, prevê as jogadas do inimigo e conduz o teu exército à vitória!

source: FIND THE STRONGEST HERO COMBINATIONS
pt_pt: DESCOBRE AS COMBINAÇÕES MAIS FORTES DE HERÓIS

source: In Hero Wars:
pt_pt: Em Hero Wars:

source: Alliance, there are more than 80 unique Heroes, each of them belonging to one of six factions:
pt_pt: Alliance encontrarás mais de 80 heróis únicos, cada um pertencente a uma de seis fações:

source: Chaos, Eternity, Honor, Mystery, Nature, and Progress.
pt_pt: Caos, Eternidade, Honra, Mistério, Natureza e Progresso.

source: Each faction has its own characteristics and gameplay style.
pt_pt: Cada fação tem as suas próprias características e estilo de jogo.

source: Learn Hero skills, find unexpected combinations, and exploit enemy weaknesses to turn the tide of battle!
pt_pt: Aprende habilidades de Herói, descobre combinações inesperadas e explora as fraquezas dos inimigos para mudares o rumo da batalha!

source: Gather a balanced team, think your tactics through, and unlock the potential of your warriors to win in PvE challenges and PvP battles.
pt_pt: Reúne uma equipa equilibrada, pondera bem as tuas táticas e desbloqueia o potencial dos teus guerreiros para ganhares desafios PvE e batalhas PvP.

source: Play as a cunning engineer, a powerful mage or any other character from the six factions!
pt_pt: Joga como um engenheiro astuto, um mago poderoso ou qualquer outra personagem das seis fações!

source: Dominate in PvP
pt_pt: Domina em PvP

source: Fight in PvP duels in the Arena, dominate over your rivals, and get to the top of the ranking!
pt_pt: Luta em duelos PvP na Arena: domina os teus rivais e chega ao topo das classificações!

source: Challenge Heroes from all over the world and prove that it's your team that deserves glory.
pt_pt: Desafia Heróis de todo o mundo e prova que a tua equipa merece a glória.

source: Compete in Legends Draft
pt_pt: Compete no Recrutamento de Lendas

source: Pick a team of random but fully leveled Heroes to win in this PvP mode.
pt_pt: Escolhe uma equipa de heróis aleatórios mas de nível máximo para ganhares neste modo PvP.

source: The player whose team is the first to gain the upper hand wins.
pt_pt: O jogador cuja equipa ficar em primeiro, ganha a vantagem.

source: Legends Draft is all about tactics!
pt_pt: No Recrutamento de Lendas tudo depende de táticas!

source: Complete all levels of PvE challenges
pt_pt: Completa todos os níveis de desafios PvE

source: Face powerful bosses in the Tower that has multiple levels.
pt_pt: Enfrenta bosses poderosos na Torre que tem vários pisos.

source: After each fight, you need to pick a buff that'll help you win the next!
pt_pt: Após cada luta, tens de escolher um efeito para te ajudar a vencer a próxima!

source: Reach the top of the Tower and get a lot of valuable loot!
pt_pt: Alcança o topo da Torre e ganha imenso saque valioso!

source: Create your own Guild or join an existing one!
pt_pt: Cria a tua própria Guilda ou junta-te a uma que já existe!

source: Take part in Guild Wars to get to the top league and fight in the Clash of Worlds.
pt_pt: Participa na Guerra de Guildas para chegares à primeira liga e participares em combates no Choque de Mundos.

source: Explore the world of the Dominion in Adventures
pt_pt: Explora o mundo de Domínio nas Aventuras

source: Adventures are limited-time events with a gripping story and epic battles.
pt_pt: Aventuras são eventos de tempo limitado com uma história envolvente e batalhas épicas.

source: Embark on Adventures in the Dominion, complete quests, kill bosses, and get unique rewards!
pt_pt: Participa em Aventuras no Domínio, completa missões, mata bosses e recebe recompensas únicas!

source: Take part in Titan Battles
pt_pt: Participa em Batalhas de Titãs

source: Titans are formidable creatures wielding the power of elements.
pt_pt: Os Titãs são criaturas formidáveis que utilizam o poder dos elementos.

source: Gather Fire, Water, Earth, Air, and Dark Titans, take part in Titan Battles, and win Guild Wars!
pt_pt: Junta os Titãs do Fogo, Água, Terra, Luz e Trevas, participa nas Batalhas de Titãs e ganha Guerras de Guildas!

source: Are you ready for battle?
pt_pt: Estás a postos para a batalha?

source: Pick warriors, predict enemy moves, and lead your team to victory!
pt_pt: Escolhe guerreiros, prevê jogadas inimigas e conduz a tua equipa à vitória!

source: Try out Rufus' updated skills!
pt_pt: Habilidades refeitas do Rufus!

source: Exciting levels and powerful bosses await!
pt_pt: Novos níveis incríveis e bosses poderosos!

source: Join the Festival of Fights and Fun and try out Rufus' updated skills in epic battles!
pt_pt: Entra no Festival da Luta e Diversão e experimenta as habilidades refeitas do Rufus em batalhas épicas!

source: Deal damage and win!
pt_pt: Dá dano e ganha!

source: Try out Rufus' updated skills and wreak unforgettable havoc!
pt_pt: Experimenta as habilidades refeitas do Rufus e rebenta com tudo!

source: Time to use your fists and have a lively feast!
pt_pt: Hora de usar os punhos e encher a barriga!

source: Join the Festival of Fights and Fun and try out Rufus' updated skills in battles!
pt_pt: Junta-te ao Festival da Luta e Diversão e experimenta as habilidades refeitas do Rufus em batalha!

source: There will be plenty of tough levels, powerful bosses, and exciting challenges.
pt_pt: Haverá imensos níveis difíceis, bosses poderosos e desafios entusiasmantes.

source: And don't miss out on special offers in the shop—all in honor of the merry red-haired drunkard!
pt_pt: E não percas as ofertas especiais na loja. Tudo em honra de um certo bebedolas bonacheirão ruivo!

source: Make sure to have lots of fun while the Festival lasts!
pt_pt: Diverte-te ao máximo enquanto dura o Festival!

source: An Eventful Update!
pt_pt: Uma grande atualização!

source: Sweet Relief A lavish feast—and a mystery for dessert!
pt_pt: Doce Alívio Uma ceia divina e um mistério de sobremesa!

source: Join the festival of fun, tasty treats, and trophies.
pt_pt: Junta-te ao festival da diversão, doces e troféus.

source: Rufus Rework Rufus has become even more reliable!
pt_pt: Renovação do Rufus Rufus ficou ainda mais fiável!

source: Now, he can protect allies not just from magic, but from pure damage as well!
pt_pt: Agora protege os seus aliados não só da magia, mas também do dano puro!

source: Golden Clover Treasure Grow the tallest Magic Tree with your Guild and get unique rewards.
pt_pt: Tesouro do Trevo Dourado Cria a maior Árvore Mágica com a tua guilda e recebe recompensas únicas.

source: Leprecat Calendar Leprecats are ready to give away their gifts!
pt_pt: Calendário Gnomolino Os gnomolinos vão dar as suas prendas!

source: Log in every day to collect them all.
pt_pt: Inicia sessão todos os dias para colecionares todas.

source: Enjoy yourself to the fullest!
pt_pt: Diverte-te ao máximo!

source: Conquer the updated PvP Arena!
pt_pt: Vence na Arena PvP atualizada!

source: Interserver battles, new leagues, and new ranking!
pt_pt: Lutas entre servers, novas ligas e classificações!

source: Choose suitable opponents, make it to the big leagues, and get the most valuable trophies!
pt_pt: Escolhe os adversários adequados, chega às grandes ligas e obtém os troféus mais valiosos!

source: Conquer the updated PvP Arena and get the most valuable trophies!
pt_pt: Vence na Arena PvP atualizada e obtém os troféus mais valiosos!

source: Introducing the new Arena!
pt_pt: Apresentamos a nova Arena!

source: Now you can fight players from any server and change opponents as many times as you want.
pt_pt: Agora podes lutar contra jogadores de qualquer servidor e mudar de oponente quantas vezes quiseres.

source: And with the new ranking system, holding the lead is now easier.
pt_pt: E com o novo sistema de classificações, ficar no topo é mais fácil.

source: We didn't forget about graphics, either—with new visuals, every battle will be even more spectacular!
pt_pt: Não nos esquecemos dos gráficos. Com os novos visuais, as batalhas serão ainda mais espetaculares!

source: Earn points, make it to the big leagues, and get awesome trophies.
pt_pt: Ganha pontos, chega às grandes ligas e obtém troféus fantásticos.

source: Become an Arena legend!
pt_pt: Torna-te uma lenda da Arena!

source: Sakura Season
pt_pt: Estação Sakura

source: Immerse yourself in the enchanting spring atmosphere!
pt_pt: Mergulha nesta fascinante atmosfera primaveril!

source: The city is overflowing with sakura flowers!
pt_pt: A cidade transborda com flores sakura!

source: Check out new skins, themed Battle Pass prizes, and exquisite visuals!
pt_pt: Vê os novos visuais, prémios temáticos do Passe de Batalha e gráficos incríveis!

source: Sakura Season is starting.
pt_pt: A Estação Sakura está a começar.

source: Immerse yourself in the enchanting spring atmoshpere!
pt_pt: Mergulha nesta fascinante atmosfera primaveril!

source: The city is overflowing with sakura petals!
pt_pt: A cidade transborda com pétalas de sakura!

source: New refined skins, themed Battle Pass prizes, and exquisite visuals await!
pt_pt: Esperam-te novos visuais refinados, prémios temáticos do Passe de Batalha e gráficos incríveis!

source: Enjoy all the surprises of the season and feel the magical spirit of change!
pt_pt: Usufrui de todas as surpresas da estação e sente o espírito mágico da mudança!

source: Ride the rock wave!
pt_pt: Surfa na onda do rock!

source: Get rebellious skins for Satori and Kali!
pt_pt: Consegue visuais rebeldes para o Satori e a Kayla!

source: Transform Satori and Kali into real rock stars with new skins!
pt_pt: Transforma Satori e Kayla em estrelas do rock com novos visuais!

source: And Satori’s upgraded skin doubles his magic crit!
pt_pt: O visual melhorado do Satori duplica o crítico mágico!

source: Ride the rock wave with new rebellious skins for Satori and Kali!
pt_pt: Surfa na onda do rock com novos visuais rebeldes para o Satori e a Kayla!

source: Transform Satori and Kali into awesome Dominion rock stars!
pt_pt: Transforma o Satori e a Kayla em incríveis estrelas de rock do Domínio!

source: You have three days to secure these sweet skins for your Heroes.
pt_pt: Tens três dias para garantir estes bonitos visuais para os teus Heróis.

source: You can also upgrade Satori’s skin, doubling his magic crit.
pt_pt: Também podes melhorar o visual do Satori para duplicar o seu crítico de dano mágico.

source: Available starting at level 15!
pt_pt: Disponível a partir do nível 15!

source: A rebellious update!
pt_pt: Uma atualização rebelde!

source: Satori rebalanced The great Fox Fire mage has become even more powerful!
pt_pt: Satori rebalanceado O grande mago de Fogo Vulpino está ainda mais poderoso!

source: Try out Satori’s new abilities and show everybody that they shouldn’t mess with this fox!
pt_pt: Testa as novas habilidades de Satori e mostra a todos que não devem brincar com esta raposa!

source: Masquerade Skins Kayla, Aidan, and Satori are ready to rock out onstage!
pt_pt: Visuais Mascarados Kayla, Aidan e Satori estão prontos para brilhar no palco!

source: New fabulous skins will bring out their style and turn them into true Dominion rock stars.
pt_pt: Os novos visuais fabulosos têm estilo e transformam-nos em verdadeiras estrelas de rock do Domínio.

source: And Satori’s outfit can be further upgraded — all stage lights on him!
pt_pt: E o visual do Satori pode ser melhorado: todos os holofotes estão nele!

source: It’s time to cause some mayhem on the battlefield!
pt_pt: Está na hora de causar o caos no campo de batalha!

source: Lucky hand: test yourself!
pt_pt: Mão sortuda: põe-te à prova!

source: Win lavish prizes in the “Seer's Game” mode!
pt_pt: Ganha prémios luxuosos no modo "Jogo da Vidente"!

source: Chabba’s mom foretells success for you!
pt_pt: A mãe do Chabba prevê o teu sucesso!

source: Pick cards to test your luck and win awesome prizes!
pt_pt: Escolhe as cartas para testares a tua sorte e ganhares prémios fantásticos!

source: Play the new minigame, win prizes, and earn 4 times as many emeralds as usual!
pt_pt: Joga o novo minijogo, ganha prémios e 4 vezes mais esmeraldas do que o habitual!

source: Success awaits you!
pt_pt: O sucesso espera por ti!

source: Pick cards in the new “Seer's Game” mode to test your luck and win prizes!
pt_pt: Escolhe cartas no novo modo "Jogo da Vidente" para testares a tua sorte e ganhares prémios!

source: There are also some great deals for you:
pt_pt: Há também algumas ofertas fantásticas para ti:

source: 4 times as many emeralds for completing tasks, bonuses for purchasing emeralds, and various other rewards!
pt_pt: 4 vezes mais esmeraldas por completares tarefas, bónus por comprares esmeraldas e várias outras recompensas!

source: Onwards, into a week of awesome deals and events!
pt_pt: Avante, para uma semana de promoções e eventos fantásticos!

source: New Talismans What do a cat, an inventor, and a mushroom duo have in common?
pt_pt: Novos talismãs O que é que um gato, um inventor e um cogumelo têm em comum?

source: Even those who know no fear tremble before Polaris’s icy glare...
pt_pt: Mesmo aqueles que nada temem, tremem perante o olhar gelado de Polaris.

source: The Polar Star A new heroine has risen out of her frozen captivity to pin down enemies with freezing magic!
pt_pt: A Estrela Polar Uma nova heroína saiu do seu cativeiro gelado para vencer inimigos com magia congelante!

source: Mushy and Shroom, Julius, and Isaac can use them to weather any storm.
pt_pt: Mushy e Shroom, Julius e Isaac podem usá-los para superar qualquer desafio.

source: ⚔️ Full-blown RPG in your browser:
pt_pt: ⚔️ RPG completo no seu browser:

source: No Downloads ❌ Just Click and Go!
pt_pt: Sem transferências ❌ Basta clicar e já está!

source: Can You Win?
pt_pt: consegues vencer?

source: Play now in your browser
pt_pt: Joga agora no teu browser

source: What secrets hide in the past?
pt_pt: Que segredos guarda o passado?

source: Take part in a new adventure with Lars and Krista!
pt_pt: Participa na nova aventura de Lars e Krista!

source: Go to Lars and Krista's homeland, beat powerful bosses, and find out why the heroes were separated at birth!
pt_pt: Vai à terra natal de Lars e Krista, derrota chefes poderosos e descobre porque é que eles foram separados à nascença!

source: Take part in a mysterious new adventure with Lars and Krista!
pt_pt: Participa numa nova aventura misteriosa com Lars e Krista!

source: In search of answers, Lars and Krista head to their ancestral homeland, but the price for the truth is steep.
pt_pt: Em busca de respostas, Lars e Krista vão até à sua terra natal ancestral, mas o preço a pagar pela verdade é caro.

source: Can the heroes pay it?
pt_pt: Será que os heróis o conseguem pagar?

source: Take part in the new adventure and find out!
pt_pt: Participa na nova aventura e descobre!

source: Get ready for dozens of unique levels with powerful bosses, difficult decisions, and the chilling mystery of why Lars and Krista were separated at birth!
pt_pt: Prepara-te para dezenas de níveis únicos com chefes poderosos, decisões difíceis e para desvendar o mistério arrepiante do motivo pelo qual Lars e Krista foram separados à nascença!

source: SLAY BOSSES IN PvE!
pt_pt: MATA BOSSES EM PvE!

source: CONQUER THE TOWER!
pt_pt: CONQUISTA A TORRE!

source: COLLECT AND UPGRADE!
pt_pt: COLECIONA E MELHORA!

source: The Dominion Spring Festival!
pt_pt: Festa de Primavera: Dominion!

source: Refill your supplies and become stronger!
pt_pt: Reabastece as tuas provisões e fica mais forte!

source: During the event, there will be great deals, souls for the Guardians of the Way of Honor, and other useful resources!
pt_pt: Durante o evento, receberás excelentes ofertas, pedras anímicas para os Guardiões do Caminho da Honra e outros recursos!

source: Discounts up to 65%—refill your supplies for a great price and become stronger!
pt_pt: Descontos até 65%. Reabastece as provisões a um bom preço e fica mais forte!

source: During the event, chests will be discounted up to 55%, featured items—up to 65%, and offers on emeralds will be x4 in value!
pt_pt: Durante o evento, as arcas terão um desconto máximo de 55%, até 65% em alguns itens e o valor das esmeraldas será de 4x.

source: Souls for the Guardians of the Way of Honor will also be available—don’t miss out on a chance to upgrade your team!
pt_pt: Pedras anímicas para Guardiões do Caminho da Honra estarão disponíveis. Não percas a oportunidade de aprimorar a tua equipa!

source: An unearthly update!
pt_pt: Uma atualização do outro mundo!

source: New Skins In these light, heavenly outfits, Iris, Soleil, and Artemis will instantly soar to heroic glory!
pt_pt: Novos visuais Com estes visuais leves e do outro mundo, Soleil e Ártemis serão instantaneamente as heroínas mais gloriosas!

source: You can also upgrade Artemis’ skin in the shop.
pt_pt: Também podes melhorar o visual de Ártemis na loja.

source: No one will be able to escape her deadly arrows!
pt_pt: Ninguém conseguir escapar às suas mortíferas flechas!

source: Master Marksman Along with her new skin, Artemis has gotten a stats upgrade.
pt_pt: Atiradora Mestre Para além do seu novo visual, Ártemis recebeu melhores atributos.

source: Her abilities have become even more dangerous!
pt_pt: As suas habilidades são agora muito mais perigosas!

source: Try out the upgraded hunter on the battlefield!
pt_pt: Combate no campo de batalha com a caçadora melhorada!

source: Conquer new heights!
pt_pt: Conquista novos feitos!

source: Summon a new Earth Titan!
pt_pt: Invoca um novo Titã da Terra!

source: Level Verdoc up and conquer the Brawls!
pt_pt: Sobe Verdoc de nível e vence as Brigas!

source: Verdoc, the Earth Summoner, enters the arena!
pt_pt: Verdoc, o Invocador da Terra, entra na arena!

source: Don’t miss your chance to level up a new Titan!
pt_pt: Não percas a tua oportunidade de subir um novo Titã de nível!

source: Summon a new Earth Titan and test him in the Brawls!
pt_pt: Invoca um novo Titã da Terra e participa com ele nas Brigas!

source: He is able to rock the mountains and crush his enemies into dust.
pt_pt: Ele consegue abalar montanhas e transformar os inimigos em pó.

source: Don’t miss your chance to max his level and test him in the Titan Brawls.
pt_pt: Não percas a tua oportunidade de chegar ao nível máximo com ele e combater com ele nas Brigas de Titãs.

source: But that’s not all!
pt_pt: Mas ainda há mais!

source: The event shop will offer you discounts on Chests and emeralds, 4x more useful resources, and much more!
pt_pt: A loja do evento oferece-te Arcas e esmeraldas com desconto, 4 vezes mais recursos úteis e muito mais!

source: Uncover East’s Mysteries!
pt_pt: Eis os mistérios do Oriente!

source: Hurry—the event will only last for three days!
pt_pt: Depressa, o evento só dura três dias!

source: Get new Lunar Skins for Soleil and Artemis!
pt_pt: Recebe novos visuais lunares para Soleil e Ártemis!

source: Turn Soleil and Artemis into weapons as deadly as a samurai sword!
pt_pt: Transforma Soleil e Ártemis em armas tão mortíferas como uma espada de samurai!

source: Only for three days, the shop will offer fabulous Lunar Skins, and the unique Superskin for Artemis will allow you to double her Health.
pt_pt: Só durante três dias: loja tem disponíveis fabulosos visuais lunares e o supervisual exclusivo para Ártemis que duplicará a Saúde dela.

source: Don’t miss out—get it!
pt_pt: Não percas a oportunidade de os reclamar!

source: Nature awakens!
pt_pt: A natureza desperta!

source: The Earth Summoner A new Titan rises from the ground along with fresh grass!
pt_pt: Invocador da Terra Um novo Titã surge vindo do chão!

source: Add Verdoc to your team and crush even the most resilient foes!
pt_pt: Adiciona Verdoc à equipa e destrói os inimigos mais fortes!

source: Ice and Lightning Spring has given Lars and Krista new strength—their updated skills are now much deadlier!
pt_pt: Gelo e Relâmpagos A primavera deu força a Lars e Krista: as suas capacidades são mais mortíferas!

source: Test the enhanced magic of the twins on the battlefield!
pt_pt: Testa a magia dos gémeos no campo de batalha!

source: A New Look for Orcs Monsters have shed their old skins and now look even more terrifying!
pt_pt: Novo visual para orcs Os monstros mudaram de peles e parecem mais assustadores!

source: See the new orcs with your own eyes.
pt_pt: Vê os novos orcs com os teus próprios olhos.

source: If you dare...
pt_pt: Se tiveres coragem...

source: Bring down the primal forces upon your enemies!
pt_pt: Faz com que as forças primitivas caiam sobre os inimigos!

source: New LiveOps for New Users
pt_pt: Novas LiveOps para novatos

source: Be a hero of Dominion myths!
pt_pt: Sê o herói do Domínio!

source: Get mythic Skins for Peech and Dark Star!
pt_pt: Obtém Visuais míticos para Peech e Estrela Sombria

source: Turn Peech and Dark Star into Greek goddesses with new Skins!
pt_pt: Transforma Peech e Estrela Sombria em deusas com novos Visuais!

source: And a Superskin for Peech doubles her Crushing!
pt_pt: E um Supervisual para Peech duplica a sua Obliteração!

source: Legends say: two goddesses have risen in Dominion—Peech & Dark Star!
pt_pt: As lendas dizem: surgiram duas deusas no Domínio: Peech e Estrela Sombria!

source: Clad them in mythic Skins and slay your enemies without mercy.
pt_pt: Veste-as com Visuais míticos e mata os teus inimigos sem piedade.

source: Hurry—the event will be on for only 3 days!
pt_pt: Depressa, o evento só dura três dias!

source: New Adventures in the Dominion
pt_pt: Novas aventuras no Domínio

source: Meet the new Hero—Guus!
pt_pt: Conhece o novo Herói: Guus!

source: Obtain the new healer Hero Guus and his friend!
pt_pt: Obtém o novo Herói curandeiro Guus e o amigo!

source: Set off on a fascinating adventure with Guus and his magic goose, and become the hero of this tale!
pt_pt: Parte numa aventura fascinante com Guus e o seu ganso mágico e torna-te o herói desta história!

source: Get the new healer Hero Guus and learn the tale of his companion—a golden goose!
pt_pt: Obtém o Herói curandeiro Guus e conhece a história do seu ganso dourado!

source: Set off on an adventure with Guus and his trusty goose!
pt_pt: Parte numa aventura com Guus e o seu fiel ganso!

source: Intense boss battles, moral dilemmas, and a touching story of friendship, strength and fate await you.
pt_pt: Esperam-te batalhas intensas contra bosses, dilemas morais e uma história emocional de amizade, força e destino.
